perf-tests/full_run_output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: supplywatch-load-test.js
        output: json (results.json)

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m40s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 1m10s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/50 VUs  0m00.9s/1m10.0s

running (0m02.0s), 02/50 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 02/50 VUs  0m01.9s/1m10.0s

running (0m03.0s), 03/50 VUs, 3 complete and 0 interrupted iterations
default   [   4% ] 03/50 VUs  0m02.9s/1m10.0s

running (0m04.0s), 04/50 VUs, 6 complete and 0 interrupted iterations
default   [   6% ] 04/50 VUs  0m03.9s/1m10.0s

running (0m05.0s), 05/50 VUs, 10 complete and 0 interrupted iterations
default   [   7% ] 05/50 VUs  0m04.9s/1m10.0s

running (0m06.0s), 06/50 VUs, 15 complete and 0 interrupted iterations
default   [   8% ] 06/50 VUs  0m05.9s/1m10.0s

running (0m07.0s), 07/50 VUs, 21 complete and 0 interrupted iterations
default   [  10% ] 07/50 VUs  0m06.9s/1m10.0s

running (0m08.0s), 08/50 VUs, 28 complete and 0 interrupted iterations
default   [  11% ] 08/50 VUs  0m07.9s/1m10.0s

running (0m09.0s), 09/50 VUs, 36 complete and 0 interrupted iterations
default   [  13% ] 09/50 VUs  0m08.9s/1m10.0s

running (0m10.0s), 09/50 VUs, 39 complete and 0 interrupted iterations
default   [  14% ] 09/50 VUs  0m09.9s/1m10.0s

running (0m11.0s), 10/50 VUs, 48 complete and 0 interrupted iterations
default   [  16% ] 10/50 VUs  0m10.9s/1m10.0s

running (0m12.0s), 10/50 VUs, 56 complete and 0 interrupted iterations
default   [  17% ] 10/50 VUs  0m11.9s/1m10.0s

running (0m13.0s), 10/50 VUs, 66 complete and 0 interrupted iterations
default   [  18% ] 10/50 VUs  0m12.9s/1m10.0s

running (0m14.0s), 10/50 VUs, 76 complete and 0 interrupted iterations
default   [  20% ] 10/50 VUs  0m13.9s/1m10.0s

running (0m15.0s), 10/50 VUs, 85 complete and 0 interrupted iterations
default   [  21% ] 10/50 VUs  0m14.9s/1m10.0s

running (0m16.0s), 10/50 VUs, 92 complete and 0 interrupted iterations
default   [  23% ] 10/50 VUs  0m15.9s/1m10.0s

running (0m17.0s), 10/50 VUs, 99 complete and 0 interrupted iterations
default   [  24% ] 10/50 VUs  0m16.9s/1m10.0s

running (0m18.0s), 10/50 VUs, 109 complete and 0 interrupted iterations
default   [  26% ] 10/50 VUs  0m17.9s/1m10.0s

running (0m19.0s), 10/50 VUs, 119 complete and 0 interrupted iterations
default   [  27% ] 10/50 VUs  0m18.9s/1m10.0s

running (0m20.0s), 10/50 VUs, 129 complete and 0 interrupted iterations
default   [  28% ] 10/50 VUs  0m19.9s/1m10.0s

running (0m21.0s), 10/50 VUs, 137 complete and 0 interrupted iterations
default   [  30% ] 10/50 VUs  0m20.9s/1m10.0s

running (0m22.0s), 10/50 VUs, 143 complete and 0 interrupted iterations
default   [  31% ] 10/50 VUs  0m21.9s/1m10.0s

running (0m23.0s), 10/50 VUs, 152 complete and 0 interrupted iterations
default   [  33% ] 10/50 VUs  0m22.9s/1m10.0s

running (0m24.0s), 10/50 VUs, 162 complete and 0 interrupted iterations
default   [  34% ] 10/50 VUs  0m23.9s/1m10.0s

running (0m25.0s), 10/50 VUs, 171 complete and 0 interrupted iterations
default   [  36% ] 10/50 VUs  0m24.9s/1m10.0s

running (0m26.0s), 10/50 VUs, 181 complete and 0 interrupted iterations
default   [  37% ] 10/50 VUs  0m25.9s/1m10.0s

running (0m27.0s), 10/50 VUs, 191 complete and 0 interrupted iterations
default   [  38% ] 10/50 VUs  0m26.9s/1m10.0s

running (0m28.0s), 10/50 VUs, 200 complete and 0 interrupted iterations
default   [  40% ] 10/50 VUs  0m27.9s/1m10.0s

running (0m29.0s), 10/50 VUs, 209 complete and 0 interrupted iterations
default   [  41% ] 10/50 VUs  0m28.9s/1m10.0s

running (0m30.0s), 10/50 VUs, 219 complete and 0 interrupted iterations
default   [  43% ] 10/50 VUs  0m29.9s/1m10.0s

running (0m31.0s), 12/50 VUs, 229 complete and 0 interrupted iterations
default   [  44% ] 12/50 VUs  0m30.9s/1m10.0s

running (0m32.0s), 15/50 VUs, 236 complete and 0 interrupted iterations
default   [  46% ] 15/50 VUs  0m31.9s/1m10.0s

running (0m33.0s), 17/50 VUs, 250 complete and 0 interrupted iterations
default   [  47% ] 17/50 VUs  0m32.9s/1m10.0s

running (0m34.0s), 20/50 VUs, 267 complete and 0 interrupted iterations
default   [  48% ] 20/50 VUs  0m33.9s/1m10.0s

running (0m35.0s), 23/50 VUs, 286 complete and 0 interrupted iterations
default   [  50% ] 23/50 VUs  0m34.9s/1m10.0s

running (0m36.0s), 25/50 VUs, 309 complete and 0 interrupted iterations
default   [  51% ] 25/50 VUs  0m35.9s/1m10.0s

running (0m37.0s), 28/50 VUs, 329 complete and 0 interrupted iterations
default   [  53% ] 28/50 VUs  0m36.9s/1m10.0s

running (0m38.0s), 31/50 VUs, 348 complete and 0 interrupted iterations
default   [  54% ] 31/50 VUs  0m37.9s/1m10.0s

running (0m39.0s), 33/50 VUs, 379 complete and 0 interrupted iterations
default   [  56% ] 33/50 VUs  0m38.9s/1m10.0s

running (0m40.0s), 36/50 VUs, 382 complete and 0 interrupted iterations
default   [  57% ] 36/50 VUs  0m39.9s/1m10.0s

running (0m41.0s), 39/50 VUs, 418 complete and 0 interrupted iterations
default   [  58% ] 39/50 VUs  0m40.9s/1m10.0s

running (0m42.0s), 41/50 VUs, 421 complete and 0 interrupted iterations
default   [  60% ] 41/50 VUs  0m41.9s/1m10.0s

running (0m43.0s), 44/50 VUs, 462 complete and 0 interrupted iterations
default   [  61% ] 44/50 VUs  0m42.9s/1m10.0s

running (0m44.0s), 47/50 VUs, 464 complete and 0 interrupted iterations
default   [  63% ] 47/50 VUs  0m43.9s/1m10.0s

running (0m45.0s), 49/50 VUs, 511 complete and 0 interrupted iterations
default   [  64% ] 49/50 VUs  0m44.9s/1m10.0s

running (0m46.0s), 50/50 VUs, 522 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  0m45.9s/1m10.0s

running (0m47.0s), 50/50 VUs, 572 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  0m46.9s/1m10.0s

running (0m48.0s), 50/50 VUs, 578 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  0m47.9s/1m10.0s

running (0m49.0s), 50/50 VUs, 628 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  0m48.9s/1m10.0s

running (0m50.0s), 50/50 VUs, 634 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  0m49.9s/1m10.0s

running (0m51.0s), 50/50 VUs, 684 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  0m50.9s/1m10.0s

running (0m52.0s), 50/50 VUs, 690 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  0m51.9s/1m10.0s

running (0m53.0s), 50/50 VUs, 740 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  0m52.9s/1m10.0s

running (0m54.0s), 50/50 VUs, 747 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  0m53.9s/1m10.0s

running (0m55.0s), 50/50 VUs, 772 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  0m54.9s/1m10.0s

running (0m56.0s), 50/50 VUs, 805 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  0m55.9s/1m10.0s

running (0m57.0s), 50/50 VUs, 833 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  0m56.9s/1m10.0s

running (0m58.0s), 50/50 VUs, 868 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  0m57.9s/1m10.0s

running (0m59.0s), 50/50 VUs, 880 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  0m58.9s/1m10.0s

running (1m00.0s), 50/50 VUs, 925 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  0m59.9s/1m10.0s

running (1m01.0s), 50/50 VUs, 931 complete and 0 interrupted iterations
default   [  87% ] 50/50 VUs  1m00.9s/1m10.0s

running (1m02.0s), 50/50 VUs, 978 complete and 0 interrupted iterations
default   [  88% ] 50/50 VUs  1m01.9s/1m10.0s

running (1m03.0s), 50/50 VUs, 984 complete and 0 interrupted iterations
default   [  90% ] 50/50 VUs  1m02.9s/1m10.0s

running (1m04.0s), 50/50 VUs, 1033 complete and 0 interrupted iterations
default   [  91% ] 50/50 VUs  1m03.9s/1m10.0s

running (1m05.0s), 50/50 VUs, 1037 complete and 0 interrupted iterations
default   [  93% ] 50/50 VUs  1m04.9s/1m10.0s

running (1m06.0s), 48/50 VUs, 1086 complete and 0 interrupted iterations
default   [  94% ] 48/50 VUs  1m05.9s/1m10.0s

running (1m07.0s), 47/50 VUs, 1093 complete and 0 interrupted iterations
default   [  96% ] 47/50 VUs  1m06.9s/1m10.0s

running (1m08.0s), 28/50 VUs, 1140 complete and 0 interrupted iterations
default   [  97% ] 28/50 VUs  1m07.9s/1m10.0s

running (1m09.0s), 24/50 VUs, 1150 complete and 0 interrupted iterations
default   [  98% ] 24/50 VUs  1m08.9s/1m10.0s

running (1m10.0s), 10/50 VUs, 1173 complete and 0 interrupted iterations
default   [ 100% ] 10/50 VUs  1m09.9s/1m10.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=757.31ms

    http_req_failed
    ✗ 'rate<0.05' rate=33.32%


  █ TOTAL RESULTS 

    checks_total.......: 3551    50.446411/s
    checks_succeeded...: 100.00% 3551 out of 3551
    checks_failed......: 0.00%   0 out of 3551

    ✓ setup: /auth/keys returned 200
    ✓ setup: response has api_key
    ✓ health: status is 200
    ✓ materials: status is 200
    ✓ signal: status is 200 or 404

    CUSTOM
    errors.........................: 0.00%  0 out of 3549
    health_req_duration............: avg=27.721504  min=0.5039  med=8.2434   max=268.1651  p(90)=76.17102  p(95)=98.28681 
    materials_req_duration.........: avg=388.748024 min=16.5785 med=367.3061 max=1162.1439 p(90)=794.1553  p(95)=858.87452
    signal_req_duration............: avg=155.405758 min=6.9502  med=110.6422 max=937.7231  p(90)=363.98248 p(95)=438.37083

    HTTP
    http_req_duration..............: avg=190.57ms   min=503.9µs med=59.07ms  max=1.16s     p(90)=644.65ms  p(95)=757.31ms 
      { expected_response:true }...: avg=208.15ms   min=503.9µs med=47.5ms   max=1.16s     p(90)=711.14ms  p(95)=793.98ms 
    http_req_failed................: 33.32% 1183 out of 3550
    http_reqs......................: 3550   50.432205/s

    EXECUTION
    iteration_duration.............: avg=1.57s      min=1.02s   med=1.64s    max=2.3s      p(90)=2.09s     p(95)=2.15s    
    iterations.....................: 1183   16.805999/s
    vus............................: 9      min=1            max=50
    vus_max........................: 50     min=50           max=50

    NETWORK
    data_received..................: 1.2 MB 18 kB/s
    data_sent......................: 401 kB 5.7 kB/s



running (1m10.4s), 00/50 VUs, 1183 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  1m10s
time="2026-08-02T09:48:43+05:30" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"